//=============================================================================
//
// CStaminaBarクラス [CStaminaBar.h]
// Author : 塚本俊彦
//
// 【使い方】
// バーの左右の端の座標とバー変動時にどちらを固定するかを
// 設定してクリエイトする。
// バーの幅（高さ）はcppで定数をいじる。
//
// スタミナを使う時にUseStamina()で使うスタミナ量をセット
// 自動回復はcppで定数設定してある
//
//=============================================================================
#ifndef _CCROWNDBAR_H_
#define _CCROWNDBAR_H_
//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../../../BASE_OBJECT/CScene2D.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CCrowdBar : public CScene2D
{
public:

	CCrowdBar(LPDIRECT3DDEVICE9 *pDevice);
	~CCrowdBar(void);

	void Update();
	void Uninit();
	void DrawUI();

	// 作成
	// 左端座標,右端座標,
	static CCrowdBar *Create(
		D3DXVECTOR2 pos,
		LPDIRECT3DDEVICE9 *pDevice);

	void Add(float value);

private:
	// 初期化
	void Init(D3DXVECTOR2 pos);

	D3DXVECTOR2 m_Pos;

	// 現在のバーの値
	float m_Value;
	// 現在のバーの値最大値
	float m_ValueMax;
	// バーの値（m_Value）１当たりのピクセル数
	float m_WidthOneValue;
};

#endif
//----EOF----