//=============================================================================
//
// CRendererクラス [CRenderer.h]
// Author : 野尻　尚希
//
//=============================================================================
#ifndef _CRENDERER_H_
#define _CRENDERER_H_
//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../MAIN/main.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CRenderer
{
public:
	// コンストラクタ
	CRenderer();

	// デストラクタ
	~CRenderer();

	//================================================
	// 初期化
	// 引数: ウインドウハンドル、ウインドウモードで表示するか
	// 戻り値: 成否
	//================================================
	HRESULT Init(HWND hWnd, BOOL bWindow);

	// 終了
	void Uninit(void);

	// 更新
	void Update();

	//================================================
	// 指定プライオリティのみ更新
	// 引数: プライオリティ
	//================================================
	void Update(int priority);
	
	// 描画
	void Draw();

	//================================================
	// 指定プライオリティのみ描画
	// 引数: 描画したいプライオリティ番号を描画したい順に入れる、最大8個
	//================================================
	void Draw(int priority, int priority2 = -1, int priority3 = -1, int priority4 = -1, int priority5 = -1, int priority6 = -1, int priority7 = -1, int priority8 = -1);
	
	//================================================
	// デバイスゲッター
	// 戻り値: デバイスのアドレス
	//================================================
	static LPDIRECT3DDEVICE9 *GetDevice(void){return &m_pD3DDevice;};

	#ifdef _DEBUG
	//================================================
	// FPSセット
	// 引数: FPS
	//================================================
	void		SetFPS(int FPS){m_nCountFPS = FPS;};
	#endif
private:
	LPDIRECT3D9					m_pD3D;					// Direct3Dオブジェクト
	static LPDIRECT3DDEVICE9	m_pD3DDevice;			// デバイスオブジェクト(描画に必要)

	#ifdef _DEBUG
	int							m_nCountFPS;			// FPSカウンタ
	#endif
};

#endif
//----EOF----