//=============================================================================
//
// CTitleクラス [CTitle.h]
// Author : 野尻　尚希
//
//=============================================================================
#ifndef _CTITLE_H_
#define _CTITLE_H_
//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../../MAIN/main.h"
#include "../../PHASE/CPhase.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene2D;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTitle : public CPhase
{
public:
	// コンストラクタ
	CTitle(void);

	// デストラクタ
	~CTitle(void);

	//=================================================================
	// 初期化関数
	// 引数: シーンのモード, デバイス
	//=================================================================
	void Init(MODE_PHASE mode, LPDIRECT3DDEVICE9* pDevice);

	// 終了
	void Uninit(void);

	// 更新
	void Update(void);

	//=================================================================
	// クリエイト関数
	// 引数: シーンのモード, デバイス
	// 戻り値: このシーンのアドレス
	//=================================================================
	static CTitle* Create(MODE_PHASE mode, LPDIRECT3DDEVICE9* pDevice);

private:
	// PUSH STARTしたときに呼ばれる
	void PushStart();

	// 必要な絵
	CScene2D* m_pBackGround;
	CScene2D* m_pLogo;
	CScene2D* m_pPushStart;
	CScene2D* m_pMenuBack;
	CScene2D* m_pCursol;

	// 現在のカーソルの位置
	int m_nCursol;
	// タイトルシーン開始からPUSH STARTが出るまでのカウント
	int m_nCount;
	// PUSHSTARTを押したかどうか
	bool m_bPushed;
	// PUSHSTART点滅カウント
	int m_nPushStartCount;
	// PUSHSTART点滅フラグ
	bool m_bPushStartFlg;
	// ぷるぷるカウント
	int m_nPuruCount;
};

#endif
//----EOF----