//=============================================================================
//
//	CCommandChartクラスの宣言(CCommandChart.h)
//
//	Author : 佐藤　諒一
//
//=============================================================================
#ifndef __CCOMMANDCHART_H__
#define __CCOMMNADCHART_H__

//-----------------------------------------------------------------------------
//	インクルード
//-----------------------------------------------------------------------------
#include "../../../MAIN/main.h"

//-----------------------------------------------------------------------------
//	マクロ定義
//-----------------------------------------------------------------------------
// コマンドの最大入力数
static const int MAX_COMMAND_KEEP = 6;

//-----------------------------------------------------------------------------
//	前方宣言
//-----------------------------------------------------------------------------
class CCommandChartUI;

//-----------------------------------------------------------------------------
//	クラス定義
//-----------------------------------------------------------------------------
class CCommandChart
{
public:
	// コンストラクタ
	// 引数：デバイス
	CCommandChart(LPDIRECT3DDEVICE9* device);

	// デストラクタ
	~CCommandChart();

	// 初期化
	void Init(void);

	// 更新
	void Update(void);

	// 描画
	void Draw(void);

	// 終了
	void Uninit(void);

private:
	// デバイスの保持
	LPDIRECT3DDEVICE9* m_pD3DDevice;
	// コマンド保持用配列
	BYTE m_aCommandKeep[MAX_COMMAND_KEEP];
	// 保持中のコマンド数
	int m_nKeepCommandNum;
	// 表示する入力されたコマンドUIの保持
	CCommandChartUI* m_apCommandUI[MAX_COMMAND_KEEP];
	// 入力後のUIを表示するx座標
	float m_fPosX;
	// 表示しているコマンドを消すまでのカウント
	int m_nCommandDethCnt;
	// コマンド入力可能かどうかのフラグ
	bool m_isCommandInput;
};

#endif

//EOF