//=============================================================================
//
// 汎用計算式用 [math.h]
// Author : 野尻　尚希
//
//=============================================================================
#ifndef _MATH_H_
#define _MATH_H_
//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../MAIN/main.h"

//*****************************************************************************
// マクロ
//*****************************************************************************
#define DEGREE_TO_RADIAN(dig)	(float)((D3DX_PI * dig) / 180.0f)		// ディグリー角度からラジアン角度へ変更
#define RADIAN_TO_DEGREE(dig)	(float)((180.0f * dig) / D3DX_PI)		// ラジアン角度からディグリー角度へ変更

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
float MagnitudeVector(D3DXVECTOR3 v);	// ベクトルを長さに変換
float PowVector(D3DXVECTOR3 v);			// ベクトルを長さの二乗に変換
// 角度正規化関数
void	NormalizeRotation(float *rot);
void	NormalizeRotation(D3DXVECTOR3 *rot);

// ２Ｄベクトルの外積
float D3DXVec2Cross(D3DXVECTOR2* v1, D3DXVECTOR2* v2);

#endif
//----EOF----