//=============================================================================
//
// CGoalクラス [CGoal.h]
// Author : 塚本　俊彦
//
// 宝物をここに運ぶ
//
//=============================================================================
#ifndef _CGOAL_H_
#define _CGOAL_H_

//=============================================================================
// インクルード
//=============================================================================
#include "../../../MAIN/main.h"
#include "../../CSCENE/CScene2D.h"

//=============================================================================
// 定数
//=============================================================================

enum GOAL_STATE{
	// なし
	GOAL_STATE_NONE = 0,
	// ゴールに宝箱持ったプレイヤが到着（1フレームのみ通る）
	GOAL_STATE_ARRIVE,
	// 転送中１段階目
	GOAL_STATE_TRANS_FIRST,
	// 転送中２段階目
	GOAL_STATE_TRANS_SECOND,
	// 転送中３段階目
	GOAL_STATE_TRANS_THIRD,
	// 転送終了
	GOAL_STATE_TRANSED,
};

//*****************************************************************************
// 前方定義
//*****************************************************************************
class CGame;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CGoal : public CScene2D
{
	// 公開メンバ
public:

	CGoal(LPDIRECT3DDEVICE9 *pDevice, int nPriority = TYPE_PRIORITY_GOAL, OBJTYPE m_objType = OBJTYPE_GOAL);
	~CGoal(void);

	void Init(void);
	void Uninit(void);
	void Update(void);

	//=======================================================================
	// クリエイト関数
	// 引数:デバイス、座標、幅、高さ、テクスチャの種類
	// 戻り値:作成したアドレス
	//=======================================================================
	static CGoal *Create(
		LPDIRECT3DDEVICE9 *pDevice,
		D3DXVECTOR3 pos,
		short nPlayerNum,
		CGame *pGame);

	// プレイヤ番号のゲッター
	short GetPlayerNum(){
		return m_nPlayerNum;
	}
	// 転送中にセットする
	void SetTrans();
	// 転送中じゃないとセットする
	void SetNoTrans();

	// 非公開メンバ
private:
	// プレイヤー番号
	short m_nPlayerNum;
	// 転送ステート
	GOAL_STATE m_State;
	// 転送するカウント
	int m_nCount;
	// 転送かフラグ
	bool m_bTransFlg;
	// ゲームインスタンス
	CGame *m_pGame;
};

#endif
//----EOF----