//=============================================================================
//
// CAnimationクラス [CAnimation.h]
// Author : 野尻　尚希
//
//=============================================================================
#ifndef _CANIMATION_H_
#define _CANIMATION_H_
//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../MAIN/main.h"

//*****************************************************************************
// マクロ
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************
// アニメーション
typedef enum
{
	ATTACK_SMALL_CHOP = 0,
	ATTACK_SMALL_ELBOW,
	ATTACK_SMALL_LARIAT,
	ATTACK_BIG_ROLLING,
	ATTACK_BIG_SHOLDER,
	ATTACK_BIG_DROPKICK,
	ATTACK_THROW_SLAP,
	ATTACK_THROW_BACKDROP,
	ATTACK_THROW_STUNNER,
	ATTACK_FINISH_BODYPRESS,
	ATTACK_FINSH_ATOMICBUSTER
}ATTACK_LIST;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CAnimation
{
public:
	// コンストラクタ
	CAnimation( void );

	// デストラクタ
	~CAnimation( void );

	// 初期化
	void Init( void );

	// 終了
	void Uninit( void );

	// 更新
	void Update( void );

private:
	//void AnimCafera

};

#endif
//----EOF----