//=============================================================================
//
// CTimeManagerクラス [CTimeManager.h]
// Author : 塚本　俊彦
//
// ゲームの残り時間を表示、管理するクラス
// スコアクラスが静的で一つしか作れなかった為残り時間表示用に使用。
// 中の定数の関係上３桁までしか設定できない。
// 数字の表示に演出を追加予定
// 
// ※ 注意
// 数字のtexture,pos,sizeはこのクラスのcppのヘッダをいじること。
//
//=============================================================================
#ifndef _CTIMEMANAGER_H_
#define _CTIMEMANAGER_H_

//=============================================================================
// インクルード
//=============================================================================
#include "../../RENDERER/CRenderer.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CSceneScore;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTimeManager
{
	// 公開メンバ
public:
	CTimeManager(LPDIRECT3DDEVICE9* pDevice, short nGameTime);
	~CTimeManager(void);

	void Init(void);
	void Uninit(void);
	void Update(void);

	// 残り何秒かゲッター
	int GetRemaining(){
		return m_nGameTime - m_nGameTimer;
	}


	// 非公開メンバ
private:
	// ゲームの制限時間
	short m_nGameTime;
	// ゲームタイマのカウント
	int m_nGameTimer;
	// 時間カウント
	unsigned int m_nTimeCur;
	unsigned int m_TimeLast;
	// ゲームタイマの数字
	CSceneScore *m_pTimeNumber;
};

#endif
//----EOF----