//=============================================================================
//
// CEffectクラス [CEffect.h]
// Author : 塚本　俊彦
//
//=============================================================================
#ifndef _CEFFECTBASE_H_
#define _CEFFECTBASE_H_

//=============================================================================
// インクルード
//=============================================================================
#include "../../../MAIN/main.h"
#include "../../CSCENE/CScene2D.h"

//=============================================================================
// 定数
//=============================================================================

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CEffectBase : public CScene2D
{
	// 公開メンバ
public:

	CEffectBase(LPDIRECT3DDEVICE9 *pDevice, int nPriority = TYPE_PRIORITY_EFFECT);
	virtual ~CEffectBase(void);

	void Init(void);
	void Uninit(void);
	void Update(void);


	// 非公開メンバ
protected:
	D3DXVECTOR3 m_vPos;
	D3DXVECTOR3 m_vVelocity;
	int m_nCount;
	int m_nCountMax;

};

#endif
//----EOF----