//=============================================================================
//
// CNumberクラス [CNumber.h]
// Author : 野尻　尚希
//
//=============================================================================
#ifndef _CNUMBER_H_
#define _CNUMBER_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../../MAIN/main.h"
#include "../../TEXTURE/CTexture.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CNumber
{
public:
	//======================================================
	// コンストラクタ
	// 引数: デバイス
	//======================================================
	CNumber(LPDIRECT3DDEVICE9 *pDevice);

	// デストラクタ
	~CNumber();

	//======================================================
	// 初期化
	// 引数: 座標、幅、高さ、テクスチャの種類
	// 戻り値: 成否
	//======================================================
	void Init(D3DXVECTOR3 pos, float width, float height, TEXTURE_TYPE texType);

	// 終了
	void Uninit(void);

	// 更新
	void Update(void);

	// 描画
	void Draw(void);

	//======================================================
	// 数字変更関数
	// 引数: 数字
	//======================================================
	void SetNumber(int number);

	//======================================================
	// クリエイト関数関数
	// 引数: デバイス、座標、幅、高さ、テクスチャー
	// 戻り値: ポインタ
	//======================================================
	CNumber* CNumber::Create(LPDIRECT3DDEVICE9 *pDevice, D3DXVECTOR3 pos, float width, float height, TEXTURE_TYPE texType);

private:
	LPDIRECT3DDEVICE9		*m_pD3DDevice;			// デバイスオブジェクト(描画に必要)
	LPDIRECT3DVERTEXBUFFER9	m_pD3DVtxBuff;			// 頂点座標情報を格納する場所のアドレスを確保する場所
	LPDIRECT3DTEXTURE9		m_pD3DTexBuff;			// テクスチャ情報を格納する場所のアドレスを確保する場所
	D3DXVECTOR3				m_vPos;					// ポリゴンの中央の位置
	D3DXVECTOR3				m_vRot;					// ポリゴンの回転
	float					m_fWidth;				// 幅
	float					m_fHeight;				// 高さ
};
#endif
//----EOF----