//=============================================================================
//
// CCountDownクラス [CCountDown.h]
// Author : 塚本　俊彦
//
// ゲーム開始のカウントダウンを行う
//
//=============================================================================
#ifndef _CCOUNTDOWN_H_
#define _CCOUNTDOWN_H_

//=============================================================================
// インクルード
//=============================================================================
#include "../../../RENDERER/CRenderer.h"

//=============================================================================
// 定数
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================
class CAnimation;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CCountDown
{
	// 公開メンバ
public:
	CCountDown(LPDIRECT3DDEVICE9 *pDevice, bool *bPlayerControl);
	~CCountDown(void);

	void Init(void);
	void Uninit(void);
	// カウントダウンが終了していたらtrue
	bool Update(void);

	// 非公開メンバ
private:
	LPDIRECT3DDEVICE9 *m_pDevice;

	// カウントダウンで表示する数字
	CAnimation *m_pFigure;
	// 生成されてからのカウント
	short m_nCount;
	// ゲーム開始するフラグ ゲームシーンから生成時にもらう
	bool *m_bPlayerControl;
	
	short TIME[5];

};

#endif
//----EOF----