//=============================================================================
//
// CMpクラス [CMp.h]
// Author : 塚本　俊彦
//
// MP。各プレイヤがこのクラスのインスタンスを持つ。
//
//=============================================================================
#ifndef _CMP_H_
#define _CMP_H_

//=============================================================================
// インクルード
//=============================================================================
#include "../../../MAIN/main.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CSceneCircle;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CMp{

public:
	CMp(LPDIRECT3DDEVICE9* pDevice);
	~CMp(void);

	void Init(float fMpMax, short playerNum);
	void Uninit(void);
	// 更新
	// プレイヤー座標、プレイヤのMPをセットする
	void Update(D3DXVECTOR3 pos, float mp);

private:
	// 描画フラグの更新（Updateで呼ばれる）
	void UpdateDrawFlg(float mp);

	// 座標
	D3DXVECTOR3 m_vPos;
	// 色
	D3DCOLOR m_Color;
	// MPのゲージ
	CSceneCircle *m_pCircle;
	// MPの最大値（描画しない判定に使う）
	float m_fMpMax;

	// 一定割合少ない状態
	bool m_bLow;
	// 一定状態少ない状態の時のカウント
	int m_nLowCount;
	// デバイス
	LPDIRECT3DDEVICE9 *m_pDevice;
};

#endif
//----EOF----