//=============================================================================
//
// CWinDrawクラス [CWinDraw.h]
// Author : 塚本　俊彦
//
// 勝利と引き分けのロゴをゲームシーン中に表示する
//
//=============================================================================
#ifndef _CWINLOSE_H_
#define _CWINLOSE_H_

//=============================================================================
// インクルード
//=============================================================================
#include "../../../RENDERER/CRenderer.h"

//=============================================================================
// 定数
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================
class CAnimation;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CWinDraw
{
	// 公開メンバ
public:
	CWinDraw(LPDIRECT3DDEVICE9 *pDevice);
	~CWinDraw(void);

	void Init(void);
	void Uninit(void);
	void Update(void);

	// 勝ちロゴを表示
	void CreateWinLogo();
	// 引き分けロゴを表示
	void CreateDrawLogo();

	// 非公開メンバ
private:
	LPDIRECT3DDEVICE9 *m_pDevice;

	// カウントダウンで表示する数字
	CAnimation *m_pLogo;
	// 生成されてからのカウント
	short m_nCount;
	// 勝利アニメと引き分けアニメのどちらか（更新でフラグ分け）
	bool m_bWin;
	bool m_bDraw;
};

#endif
//----EOF----