//=============================================================================
//
// CTreasureManagerクラス [CTreasureManager.h]
// Author : 塚本　俊彦
//
// 宝物マネージャー　こいつを介して宝物を生成する
//
//=============================================================================
#ifndef _CTREASUREMANAGER_H_
#define _CTREASUREMANAGER_H_

//=============================================================================
// インクルード
//=============================================================================
#include "../../../RENDERER/CRenderer.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CTreasure;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTreasureManager
{
	// 公開メンバ
public:
	CTreasureManager(LPDIRECT3DDEVICE9 *pDevice);
	~CTreasureManager(void);

	void Init(void);
	void Uninit(void);
	void Update(void);

	// お宝生成関数
	void CreateTreasure(D3DXVECTOR3 pos);

	// 非公開メンバ
private:
	// お宝実体
	CTreasure *m_pTreasure;

	// デバイス
	LPDIRECT3DDEVICE9 *m_pDevice;
};

#endif
//----EOF----