//=============================================================================
//
// CDirectクラス [CDirect.h]
// Author : 池島　大樹
//
//=============================================================================
#ifndef _CDIRECT_H_
#define _CDIRECT_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../../MAIN/main.h"
#include "../../MANAGER/CManager.h"
#include "../../SCENE/GAME/PLAYER/CPlayerManager.h"

//*****************************************************************************
// マクロ
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CDirect
{
public:
	// コンストラクタ
	CDirect( CManager *pManager );

	// デストラクタ
	~CDirect( void );

	// 初期化
	virtual void Init( PLAYER_ID playerID ) = 0;

	// 終了
	virtual void Uninit( void ) = 0;

	// 更新
	virtual void Update( void ) = 0;

	// 演出が終了したかチェック
	void CheckEnd( void );

	void SetPlayerID( PLAYER_ID playerID );

protected:
	CManager *m_pManager;
	PLAYER_ID m_Player;				// メインとなるプレイヤー
	PLAYER_ID m_Enemy;				// 相手となるプレイヤー
	int m_FrameCount;				// 演出の現在フレーム
	int m_TotalFrame;				// 演出の総フレーム数
};

#endif
//----EOF----