//=============================================================================
//
// CDirectRopeクラス [CDirectRope.h]
// Author : 池島　大樹
//
//=============================================================================
#ifndef _CDIRECTROPE_H_
#define _CDIRECTROPE_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../../MAIN/main.h"
#include "CDirect.h"
#include "../CDirectorManager.h"

#include "../../SCENE/GAME/COMMANDCHART/CCommandChart.h"

//*****************************************************************************
// マクロ
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CDirectRope : public CDirect
{
public:
	// コンストラクタ
	CDirectRope( CManager *pManager, CGame *pGame );

	// デストラクタ
	~CDirectRope( void );

	// 初期化
	void Init( PLAYER_ID playerID );

	// 終了
	void Uninit( void );

	// 更新
	void Update( void );

private:
	COMMAND_TYPE m_CommandPlayer[2];
	PLAYER_ID m_WinnerID;
	PLAYER_ID m_LoserID;
};

#endif
//----EOF----