//=============================================================================
//
// テクスチャー処理 [CTexture.h]
// Author : 野尻　尚希
//
//=============================================================================
#ifndef _CTEXTURE_H_
#define _CTEXTURE_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../MAIN/main.h"

//*****************************************************************************
// 列挙体
//*****************************************************************************
// テクスチャの種類
typedef enum
{
	TEXTURE_MONO = 0,				// トゥーン用
	TEXTURE_DEFAULT,			// モデルのデフォルトテクスチャ
	TEXTURE_NUMBER,				// 数字
	TEXTURE_TITLE,
	TEXTURE_RESULT,
	TEXTURE_PLAYER,
	TEXTURE_HP_GAGE_G,			// 体力ゲージみどり
	TEXTURE_HP_GAGE_R,			// 体力ゲージ減った時の赤
	TEXTURE_HP_GAGE_FRAME,		// 体力ゲージの枠
	TEXTURE_CROWD_GAGE_FRAME,	// 観客ゲージの枠
	TEXTURE_CROWD_GAGE_HUMAN,	// 観客ゲージ上の人間
	TEXTURE_CROWD_SPARK,		// 観客ゲージ中央のバチバチ
	TEXTURE_BLUE,				// リングテクスチャ
	TEXTURE_RED,				// リングテクスチャ
	TEXTURE_METALICGRAY,		// リングテクスチャ
	TEXTURE_WINDOWS,			// リングテクスチャ

	TEXTURE_MAX					// テクスチャタイプ総数
}TEXTURE_TYPE;

//*****************************************************************************
// クラス宣言
//*****************************************************************************
class CTexture
{
public:
	// コンストラクタ
	CTexture(void){};

	// デストラクタ
	~CTexture(void){};

	// 終了
	static void Uninit( void );

	//============================================================
	// クリエイト
	// 引数:デバイス
	//============================================================
	static void CreateTexture(LPDIRECT3DDEVICE9 *pDevice);

	//============================================================
	// テクスチャゲッター
	// 引数:テクスチャの種類
	// 戻り値:テクスチャのポインタ
	//============================================================
	static LPDIRECT3DTEXTURE9 GetTexture(const TEXTURE_TYPE type);

private:
	//============================================================
	// 初期化
	// 引数:デバイス
	// 戻り値:成否
	//============================================================
	static	HRESULT Init( LPDIRECT3DDEVICE9 *pDevice );

	static	LPDIRECT3DTEXTURE9 m_pD3DTex[TEXTURE_MAX];				// テクスチャポインタ
	static	bool m_bDoneCreateFlag;									// すでに作ったかのフラグ
};

#endif
//----EOF----