//=============================================================================
//
// CControllerクラス [ CController.h]
// Author : 野尻　尚希
//
//=============================================================================
#ifndef _CCONTROLLER_H_
#define _CCONTROLLER_H_

//=============================================================================
// インクルード
//=============================================================================
#include "../INPUT/CInputGamePad.h"

//=============================================================================
// クラス定義
//=============================================================================
class CController
{
public:

	// コンストラクタ
	CController(void);

	// デストラクタ
	~CController(void);

	// 終了
	void Uninit(void);

	//======================================
	// クリエイト
	// 引数：ＩＤ, キーコンフィグファイル
	// 戻り値：アドレス
	//======================================
	static CController* Create(int ID, const char* keyCofingFile);

	//======================================
	// トリガーキー取得
	// 引数: 調べたいキー
	// 戻り値: 押されてるか
	//======================================
	bool GetTriggerKey(CInputGamePad::KEY key);

	//======================================
	// プレスキー取得
	// 引数: 調べたいキー
	// 戻り値: 押された瞬間か
	//======================================
	bool GetPressKey(CInputGamePad::KEY key);

	//======================================
	// リリースキー取得
	// 引数: 調べたいキー
	// 戻り値: 離された瞬間か
	//======================================
	bool GetReleaseKey(CInputGamePad::KEY key);

	//======================================
	// リピートキー取得
	// 引数: 調べたいキー
	// 戻り値: 離された瞬間か
	//======================================
	bool GetRepeatKey(CInputGamePad::KEY key);

	//======================================
	// キーコフィングファイルのセーブ
	// 引数: ファイルネーム
	//======================================
	void SaveKeyCofingFile(const char* keyCofingFile);

	//======================================
	// キーコフィングファイルのセット
	// 引数: どのボタンか、キーコード
	//======================================
	void SetKeyCord(CInputGamePad::PAD_BUTTON key, int cord){ m_nButtonKeyCord[key] = cord; };

	//======================================
	// キーコフィングファイルのゲット
	// 引数: どのボタンか
	// 戻り値：キーコード
	//======================================
	int GetKeyCord(CInputGamePad::PAD_BUTTON key){ return m_nButtonKeyCord[key]; };

	//======================================
	// キーコフィング情報の更新
	//======================================
	void UpdateKeyCord(void);

private:
	//======================================
	// 初期化
	// 引数：ＩＤ, キーコンフィグファイル
	//======================================
	void Init(int ID, const char* keyCofingFile);

	//======================================
	// キーコフィングファイルのロード
	// 引数: ファイルネーム
	//======================================
	void LoadKeyCofingFile(const char* keyCofingFile);

	int		m_nID;												// コントローラーのID
	int		m_nButtonKeyCord[CInputGamePad::PAD_KEY_MAX];	// ボタンのキーコード
};



#endif
//-----EOF-----